task-tracker-1c/src/Catalogs/тз_СостоянияЗаданий/тз_СостоянияЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тз_СостоянияЗаданий</name>
  <predefined>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Новое</name>
      <description>Новое</description>
    </items>
  </predefined>
  <attributes>
    <name>СтатусВыполнения</name>
    <type>
      <types>EnumRef.тз_СтатусыВыполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

task-tracker-1c/src/Enums/тз_СтатусыВыполнения/тз_СтатусыВыполнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>тз_СтатусыВыполнения</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

task-tracker-1c/src/Catalogs/тз_СостоянияЗаданий/ManagerModule.bsl
Процедура ВыполнитьПервоначальноеЗаполнение(Отказ = Ложь) Экспорт
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Новое.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Новое");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.ВРаботе.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.ВРаботе");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
	ПредопределенныйЭлемент = Справочники.тз_СостоянияЗаданий.Завершено.ПолучитьОбъект();
	ПредопределенныйЭлемент.СтатусВыполнения = ПредопределенноеЗначение("Перечисление.тз_СтатусыВыполнения.Завершено");
	
	Попытка
		ПредопределенныйЭлемент.Записать();
	Исключение
		Отказ = Истина;
		ОтменитьТранзакцию();
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось заполнить предопределенное состояние:
			|%1'"),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		тз_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры
